app/views/posts/index.html.erb

        <td><%= post.content %></td>
        <td><%= post.likes.size %>명이 찜함</td>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]