app/views/posts/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 2]]
---
  <form action='/post/<%= @post.id%>/like' method='post'>
  <button><i class="fa fa-heart" aria-hidden="true"></i>　<%= @post.likes.size %></button>