app/controllers/likes_controller.rb

	def like_toggle
 	 like = Like.find_by(user_id: current_user.id, post_id: params[:post_id])

  		if like.nil?
   	 		Like.create(user_id: current_user.id, post_id: params[:post_id])
  		else
   			 like.destroy

  end

  redirect_to @post = Post.find(params[:post_id])
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 1], ["user_id", 1], ["created_at", "2021-11-30 07:27:17.763139"], ["updated_at", "2021-11-30 07:27:17.763139"]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]