app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "당근팔아요"], ["content", "2000원"], ["created_at", "2021-12-02 03:32:12.207708"], ["updated_at", "2021-12-02 03:32:12.207708"], ["user_id", 1]]