app/controllers/rooms_controller.rb

SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = $1  [["room_id", 1]]
SELECT "rooms".* FROM "rooms"
---
def show
  @room_message = RoomMessage.new room: @room
  @room_messages = @room.room_messages.includes(:user)

INSERT INTO "rooms" ("created_at", "updated_at", "name") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2021-12-03 05:19:11.874847"], ["updated_at", "2021-12-03 05:19:11.874847"], ["name", "sdas"]]
---
  def create
    @room = Room.new permitted_parameters

    if @room.save

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def load_entities
    @rooms = Room.all
    @room = Room.find(params[:id]) if params[:id]