app/controllers/room_messages_controller.rb

INSERT INTO "room_messages" ("room_id", "user_id", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["room_id", 1], ["user_id", 1], ["message", "안녕"], ["created_at", "2021-12-03 05:20:22.851952"], ["updated_at", "2021-12-03 05:20:22.851952"]]
---
def create
  @room_message = RoomMessage.create user: current_user,
                                     room: @room,
                                     message: params.dig(:room_message, :message)

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def load_entities
    @room = Room.find params.dig(:room_message, :room_id)