app/models/user.rb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]
---
	def is_like? (post)
		Like.find_by(user_id: self.id, post_id: post.id).present?